Repository: shehroz2260/bloc_app
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Start
ur: شروع کریں

# appName
source: Friendzy
ur: فرینڈزی

source: Update
ur: اپ ڈیٹ کریں

source: Preferences
ur: ترجیحی

# dob
source: Date of Birth
ur: پیدائش کی تاریخ

# selectDob
source: Select date of birth
ur: پیدائش کی تاریخ منتخب کریں

source: Sign In
ur: سائن ان کریں

source: Logout
ur: لاگ آؤٹ

source: Women
ur: خواتین

# or
source: or sign in with
ur: یا سائن ان کریں

source: Men
ur: مرد

source: Male
ur: مرد

source: Photography
ur: فوٹوگرافی

source: Shopping
ur: شاپنگ

# voice
source: Karaoke
ur: کیراؤکے

source: Yoga
ur: یوگا

source: Cooking
ur: پکانا

source: Tennis
ur: ٹینس

source: Run
ur: دوڑنا

source: Swimming
ur: سوئمنگ

source: Art
ur: آرٹ

source: Story
ur: کہانی

# tAc
source: Terms & Conditions
ur: شرائط و ضوابط

source: Contact us
ur: ہم سے رابطہ کریں

source: Traveling
ur: سفر کرنا

source: Extreme
ur: انتہائ

source: Music
ur: موسیقی

source: Drink
ur: مشروب

source: Video games
ur: ویڈیو گیمز

source: Female
ur: خاتون

source: Both
ur: دونوں

source: Filter
ur: فلٹر

source: Gender
ur: صنف

source: Next
ur: اگلا

source: Sign in with Google
ur: گوگل کے ساتھ سائن ان کریں

source: Sign in with Email
ur: ای میل کے ساتھ سائن ان کریں

# continueToEmail
source: Continue with email
ur: ای میل کے ذریعے جاری رکھیں

source: Use phone number
ur: فون نمبر استعمال کریں

source: Sign Up
ur: سائن اپ کریں

source: Profile
ur: پروفائل

source: Yes
ur: جی ہاں

source: Enter bio
ur: بایو درج کریں

source: Bio
ur: بایو

source: Enter about your self
ur: اپنے بارے میں درج کریں

source: About your self
ur: اپنے بارے میں

# firsyName
source: First Name
ur: پہلا نام

source: No
ur: نہیں

source: Interested
ur: دلچسپی

source: Do you really want to logout
ur: کیا آپ واقعی لاگ آؤٹ کرنا چاہتے ہیں؟

source: Delete Account
ur: اکاؤنٹ حذف کریں

# doYouReallyWantToDeleteYourAccount
source: Do you really want to delete your account, This action is permanent and cannot be undo.
ur: کیا آپ واقعی اپنا اکاؤنٹ حذف کرنا چاہتے ہیں؟ یہ عمل مستقل ہے اور واپس نہیں کیا جا سکتا۔

source: Need your location
ur: آپ کی لوکیشن درکار ہے

source: Choose birthday date
ur: پیدائش کی تاریخ منتخب کریں

source: Permission Error
ur: اجازت کی خرابی

# pleaseGiveUSAccesstoYourGps
source: Please give us access to your Gps Location for better experience to see user nearby you.
ur: براہ کرم ہمیں بہتر تجربہ کے لئے آپ کی جی پی ایس لوکیشن تک رسائی دیں تاکہ ہم آپ کے قریب صارفین کو دیکھ سکیں۔

source: Please turn on precise location.
ur: براہ کرم درست لوکیشن کو فعال کریں۔

source: Pick image from Gallery
ur: گیلری سے تصویر منتخب کریں

source: Profile details
ur: پروفائل کی تفصیلات

source: Explore
ur: دریافت کریں

source: Other Stories
ur: دیگر کہانیاں

# pleaseEntervalidttp
source: Please enter valid otp
ur: براہ کرم درست OTP درج کریں

source: Please enter the otp for confirmation
ur: تصدیق کے لئے OTP درج کریں

source: Matches
ur: میچز

source: Options
ur: آپشنز

source: Images
ur: تصاویر

source: Video
ur: ویڈیو

source: There is no story
ur: کوئی کہانی نہیں ہے

source: Confirm
ur: تصدیق کریں

source: Please enter password for confirmation
ur: تصدیق کے لئے پاسورڈ درج کریں

source: Photos
ur: تصاویر

source: Cancel
ur: منسوخ کریں

source: Preference gender
ur: ترجیحی جنس

source: Camera
ur: کیمرہ

source: Verify
ur: تصدیق کریں

# pleaseEnterYourValidPhoneNumber
source: Please enter your valid phone number. We will send you a 6-digit code to verify your account.
ur: براہ کرم اپنا درست فون نمبر درج کریں۔ ہم آپ کو اپنے اکاؤنٹ کی تصدیق کے لئے 6 ہندسوں کا کوڈ بھیجیں گے۔

source: Phone Number
ur: فون نمبر

source: Send again
ur: دوبارہ بھیجیں

source: Enter valid pin
ur: صحیح پن درج کریں

source: Enter pin
ur: پن درج کریں

source: Your insterest
ur: آپ کی دلچسپیاں

source: Enable Location
ur: مقام فعال کریں

source: Matched
ur: میچ ہو گیا

source: Success
ur: کامیابی

# typeTheVerificationCodeWeHaveSentyou
source: Type the verification code we’ve sent you
ur: ہم نے جو تصدیقی کوڈ بھیجا ہے وہ درج کریں

source: Reset link has been sent to your email
ur: ری سیٹ کا لنک آپ کی ای میل پر بھیج دیا گیا ہے

# selectAFewfyourinstrest
source: Select a few of your interests and let everyone know what you’re passionate about.
ur: اپنی چند دلچسپیاں منتخب کریں اور سب کو بتائیں کہ آپ کس چیز کے بارے میں پرجوش ہیں۔

source: Take Photo
ur: تصویر لیں

source: PASSWORD
ur: پاس ورڈ

source: Send
ur: بھیجیں

source: Congrats!
ur: مبارک ہو!

# forgotPasswords
source: Forgot Password
ur: پاس ورڈ بھول گئے؟

# nowYouAreReadyToExplorethepeople
source: Now you are ready to explore the peoples and make match with your perfect partener
ur: اب آپ لوگوں کو دریافت کرنے اور اپنے کامل شریک حیات سے میچ کرنے کے لئے تیار ہیں

source: You are all set your profile
ur: آپ کا پروفائل سیٹ ہو چکا ہے

source: Choose value
ur: ویلیو منتخب کریں

source: USERNAME
ur: یوزر نیم

source: Sign in to continue
ur: جاری رکھنے کے لئے سائن ان کریں

source: Choose from library
ur: کتب خانہ سے منتخب کریں

source: Pick image from camera
ur: کیمرہ سے تصویر منتخب کریں

source: Permission for video recording
ur: ویڈیو ریکارڈنگ کے لئے اجازت

# continues
source: Continue
ur: جاری رکھیں

source: Gallery
ur: گیلری

source: Later
ur: بعد میں

source: See Profile
ur: پروفائل دیکھیں

source: No account?
ur: کیا آپ کا اکاؤنٹ نہیں ہے؟

source: Edit Profile
ur: پروفائل ایڈٹ کریں

source: E-MAIL ADDRESS
ur: ای میل ایڈریس

source: USERNAME/EMAIL
ur: یوزر نیم/ای میل

source: Enter password
ur: پاس ورڈ درج کریں

source: Update profile
ur: پروفائل اپ ڈیٹ کریں

# enterYourName
source: Enter your first name
ur: اپنا پہلا نام درج کریں

source: Enter username
ur: یوزر نیم درج کریں

# forgotPassword
source: Forget Password?
ur: پاس ورڈ بھول گئے؟

source: You are all set up
ur: آپ سیٹ ہو گئے ہیں

source: Edit Phone number
ur: فون نمبر ایڈٹ کریں

source: Create an account!
ur: اکاؤنٹ بنائیں!

source: Edit profile image
ur: پروفائل کی تصویر ایڈٹ کریں

# editGalleryImage
source: Edit Gallery images
ur: گیلری کی تصاویر ایڈٹ کریں

source: Enter email address
ur: ای میل ایڈریس درج کریں

source: Write something here...
ur: یہاں کچھ لکھیں...

# contactCreateTattoo
source: Connect, Create, Tattoo!
ur: رابطہ کریں، تخلیق کریں، ٹیٹو!

source: Enter your phone number
ur: اپنا فون نمبر درج کریں

source: Already have an account?
ur: کیا پہلے سے اکاؤنٹ ہے؟

# createAnAccoun
source: Create an account
ur: اکاؤنٹ بنائیں

source: I am a
ur: میں ایک ہوں

source: Whats your phone number?
ur: آپ کا فون نمبر کیا ہے؟

source: Discover
ur: دریافت کریں

# addYourfirst2Photo
source: Add your first 2 photos
ur: اپنی پہلی 2 تصاویر شامل کریں

# endLessTatooInspiration
source: endless tattoo inspiration
ur: لامحدود ٹیٹو کی ترغیب

# wematchYouWithPeople
source: We match you with people that have a large array of similar interests.
ur: ہم آپ کو لوگوں سے میچ کرتے ہیں جن کی دلچسپیاں آپ سے ملتی ہیں

# writeSomeDescription
source: Write some description about you?
ur: اپنے بارے میں کچھ وضاحت لکھیں

source: Enter user name or email address
ur: یوزر نیم یا ای میل ایڈریس درج کریں

source: Discover talented artists, and explore
ur: ہنر مند فنکاروں کو دریافت کریں، اور دریافت کریں

source: This will help user to know more about you
ur: یہ صارف کو آپ کے بارے میں مزید جاننے میں مدد کرے گا

# selectYourRoleSowewouldgiveyou
source: Select your role so we would give you match according to that.
ur: اپنا کردار منتخب کریں تاکہ ہم آپ کو اسی کے مطابق میچ دے سکیں

# weAreSettingUpYourProfile
source: We are setting up your profile and so you can connect with top artists today!
ur: ہم آپ کا پروفائل سیٹ کر رہے ہیں تاکہ آپ آج ہی ٹاپ آرٹسٹس سے جڑ سکیں!

# selectPhotosThatExpressYourPersonality
source: Select photos that express your personality and show you doing things you love
ur: وہ تصاویر منتخب کریں جو آپ کی شخصیت کو ظاہر کرتی ہوں

source: Choose value
ur: قدرت منتخب کریں

source: Interests
ur: دلچسپیاں

source: About
ur: کے بارے میں

source: Location
ur: مقام

source: Distance
ur: فاصلہ

source: All
ur: سب

source: Not now
ur: ابھی نہیں

source: Direction
ur: سمت

source: Do you want to get direction
ur: کیا آپ سمت حاصل کرنا چاہتے ہیں؟

source: There is no users
ur: کوئی صارف موجود نہیں ہے

source: Apply
ur: لاگو کریں

source: Settings
ur: ترتیبات

source: FAQs
ur: سوالات

source: Are you sure!
ur: کیا آپ کو یقین ہے

source: Change password
ur: پاس ورڈ تبدیل کریں

source: About us
ur: ہمارے بارے میں

source: Change Language
ur: زبان تبدیل کریں

source: See all
ur: سب دیکھیں

# aboutWithColon
source: About:
ur: اپنے بارے میں

source: EnTer bio
ur: بائیو درج کریں

source: Show me
ur: مجھے دکھائیں

# ageWithColon
source: Age:
ur: عمر

source: Keep swiping
ur: سوائپ کرتے رہیں

source: Enter your first message
ur: اپنا پہلا پیغام درج کریں

source: Enter valid number
ur: درست نمبر درج کریں

source: Send your first message
ur: اپنا پہلا پیغام بھیجیں

source: Open setting
ur: ترتیب کھولیں

source: Start a conversation now with each other
ur: اب ایک دوسرے سے گفتگو شروع کریں

source: User reported successfully
ur: صارف کو کامیابی سے رپورٹ کر دیا گیا

# pleaseEnableCamera
source: Please Enable Camera, Microphone, Audio and photos from setting
ur: براہ کرم سیٹنگ سے کیمرہ، مائیکروفون، آڈیو اور تصاویر کو فعال کریں

# checkInternet
source: Please check Internet Connection
ur: براہ کرم انٹرنیٹ کنکشن چیک کریں

source: Something went wrong
ur: کچھ غلط ہو گیا

# nameReq
source: Name is Required
ur: نام ضروری ہے

# enterAbout
source: Enter About your self
ur: اپنے بارے میں درج کریں

# usernameReq
source: Username is Required
ur: صارف نام ضروری ہے

# descReq
source: Description is Required
ur: تفصیل ضروری ہے

# addressReq
source: Address is Required
ur: پتہ ضروری ہے

# fieldReq
source: Field is Required
ur: فیلڈ ضروری ہے

source: Phone number is required
ur: فون نمبر ضروری ہے

# emailReq
source: Email is Required
ur: ای میل ضروری ہے

# validPhoneNumber
source: Please enter a valid phone number
ur: براہ کرم درست فون نمبر درج کریں

# birthDayReq
source: Birthday is Required
ur: سالگرہ ضروری ہے

# emailInvalid
source: Email is Invalid
ur: ای میل غلط ہے

source: Edit
ur: ترمیم کریں

source: First Name:
ur: پہلا نام

# bios
source: Bio:
ur: بایو

source: Block
ur: بلاک

source: Image
ur: تصویر

source: Do you really want to Block
ur: کیا آپ واقعی بلاک کرنا چاہتے ہیں

# thisActionisPermanent
source: , This action action is permanent and cannot be undo
ur: ، یہ ایکشن ایکشن مستقل ہے اور اسے کالعدم نہیں کیا جا سکتا

source: Do you really want to report
ur: کیا آپ واقعی رپورٹ کرنا چاہتے ہیں

source: Do you really want to clear chat
ur: کیا آپ واقعی چیٹ صاف کرنا چاہتے ہیں؟

source: Un Block
ur: ان بلاک

source: Report
ur: رپورٹ

source: Clear chat
ur: صاف بات چیت

source: Confirm Password is req
ur: تصدیق کریں پاس ورڈ درکار ہے

source: Update Password
ur: پاس ورڈ اپ ڈیٹ کریں

source: Enter confirm password
ur: تصدیقی پاس ورڈ درج کریں

# theConfirmationMessageDoesNotMatch
source: The confirmation password does not match. Please try again.
ur: تصدیقی پاس ورڈ مماثل نہیں ہے۔ براہ کرم دوبارہ کوشش کریں

source: Enter new password
ur: نیا پاس ورڈ درج کریں

source: New Password is req
ur: نیا پاس ورڈ درکار ہے

source: Enter old password
ur: پرانا پاس ورڈ درج کریں

# yourNewPasswordCannotBeTheSame
source: Your new password cannot be the same as your old password. Please choose a different
ur: آپ کا نیا پاس ورڈ آپ کے پرانے پاس ورڈ جیسا نہیں ہو سکتا۔ براہ کرم ایک مختلف منتخب کریں

# passwordMustbe8
source: Password length must be 8
ur: پاس ورڈ کی لمبائی 8 ہونی چاہیے

source: Old Password is req
ur: پرانا پاس ورڈ درکار ہے

source: Search...
ur: تلاش کریں

source: Messages
ur: پیغامات

source: Add image
ur: تصویر شامل کریں

source: Enter first name
ur: پہلا نام درج کریں

# bioIsReq
source: Bio is required
ur: بایو ضروری ہے

source: Clear
ur: صاف

source: Connected
ur: منسلک

source: Age
ur: عمر

source: Remove match
ur: میچ کو ہٹا دیں

source: Say, hello
ur: کہو، ہیلو

source: There is no matched
ur: کوئی مماثلت نہیں ہے

source: Likes
ur: پسند

source: Match
ur: میچ

source: Write your text
ur: اپنا متن لکھیں

source: Write Description
ur: تفصیل لکھیں

source: Send match request
ur: میچ کی درخواست بھیجیں

# doYouReallyWantToRemoveMatch
source: Do you really want to remove match, This action is permanent and cannot be undo
ur: کیا آپ واقعی میچ کو ہٹانا چاہتے ہیں، یہ عمل مستقل ہے اور اسے کالعدم نہیں کیا جا سکتا

source: Password updated successfully!
ur: پاس ورڈ کامیابی سے اپ ڈیٹ ہو گیا

# doYouReallyWantToDeleteImage
source: Do you really want to delete image, this action is permanent and cannot be undo
ur: کیا آپ واقعی تصویر کو حذف کرنا چاہتے ہیں، یہ عمل مستقل ہے اور اسے کالعدم نہیں کیا جا سکتا

# option1
source: Fake profile
ur: جعلی پروفائل

# option2
source: Selling/scamming content
ur: مواد فروخت کرنا / دھوکہ دہی

# option3
source: Nudity/sexual content
ur: عریانیت/جنسی مواد

# option4
source: Abusive/Threatening content
ur: بدسلوکی/ دھمکی آمیز مواد

source: Please select option
ur: براہ کرم آپشن منتخب کریں

source: Report User
ur: صارف کی رپورٹ دیں

source: Get into App
ur: ایپ میں داخل ہوں

# option5
source: Suspect under aged (18)
ur: ملزم (18) سے کم عمر

# pleasSelctAtoneInsterext
source: Please select at least one instrest
ur: براہ کرم کم از کم ایک انسٹرسٹ منتخب کریں

# pickOneGender
source: Please pick one gender
ur: براہ کرم ایک جنس منتخب کریں

# dobIsReq
source: Dob is required
ur: تاریخ پیدائش درکار ہے

# imageIsReq
source: Image is required
ur: تصویر درکار ہے

# passwordReq
source: Password is Required
ur: پاس ورڈ ضروری ہے

# aboutIsReq
source: About is required
ur: کے بارے میں ضروری ہے

# passwordContain8Char
source: The password must be at least 8 characters
ur: پاس ورڈ کم از کم 8 حروف کا ہونا چاہئے

# passwordContain
source: Contain Capital, small letter & Number & Special
ur: بڑا حرف، چھوٹا حرف، نمبر اور خاص حرف شامل ہوں

# question1
source: How do I create an account?
ur: میں اکاؤنٹ کیسے بنا سکتا ہوں؟

# question2
source: Is my personal information safe?
ur: کیا میری ذاتی معلومات محفوظ ہیں؟

# question3
source: How does the matching process work?
ur: میچنگ کا عمل کیسے کام کرتا ہے؟

# question4
source: Can I block or report someone?
ur: کیا میں کسی کو بلاک یا رپورٹ کرسکتا ہوں؟

# question5
source: Are there in-app purchases?
ur: کیا ایپ میں ان ایپ پرچیزز ہیں؟

# question6
source: How can I delete my account?
ur: میں اپنا اکاؤنٹ کیسے ڈیلیٹ کرسکتا ہوں؟

# question7
source: Can I use the app if I’m not looking for a serious relationship?
ur: کیا میں ایپ کو استعمال کر سکتا ہوں اگر میں سنجیدہ تعلق کی تلاش میں نہ ہوں؟

# question8
source: How do I reset my password?
ur: میں اپنا پاس ورڈ کیسے ری سیٹ کر سکتا ہوں؟

# question9
source: What should I do if I’m having technical issues?
ur: اگر مجھے تکنیکی مسائل پیش آئیں تو مجھے کیا کرنا چاہیے؟

# question10
source: Can I use the app in multiple countries?
ur: کیا میں ایپ کو متعدد ممالک میں استعمال کر سکتا ہوں؟

# answer1
source: To create an account, simply download the Friendzy from the App Store or Google Play, open the app, and follow the registration prompts. You can sign up using your email address, phone number, or social media accounts.
ur: اکاؤنٹ بنانے کے لیے، صرف ایپ اسٹور یا گوگل پلے سے فرینڈزی ڈاؤن لوڈ کریں، ایپ کھولیں، اور رجسٹریشن کے اشارے پر عمل کریں۔ آپ اپنا ای میل پتہ، فون نمبر، یا سوشل میڈیا اکاؤنٹس استعمال کر کے سائن اپ کر سکتے ہیں

# answer2
source: Yes! At Friendzy, we prioritize your privacy and security. We use advanced encryption and privacy controls to protect your information. We never share your data with third parties without your consent.
ur: جی ہاں! فرینڈزی میں، ہم آپ کی رازداری اور سلامتی کو ترجیح دیتے ہیں۔ ہم آپ کی معلومات کی حفاظت کے لیے اعلی درجے کی خفیہ کاری اور رازداری کے کنٹرولز کا استعمال کرتے ہیں۔ ہم آپ کی رضامندی کے بغیر آپ کا ڈیٹا تیسرے فریق کے ساتھ کبھی بھی شیئر نہیں کرتے ہیں

# answer3
source: Our matching algorithm takes into account your interests, preferences, and location to suggest potential matches. The more you interact with the app, the better your matches will become!
ur: ہمارا مماثل الگورتھم ممکنہ مماثلت تجویز کرنے کے لیے آپ کی دلچسپیوں، ترجیحات اور مقام کو مدنظر رکھتا ہے۔ آپ ایپ کے ساتھ جتنا زیادہ تعامل کریں گے، آپ کے میچ اتنے ہی بہتر ہوں گے!

# answer4
source: Absolutely! If you encounter someone who makes you uncomfortable, you can easily block or report them through their profile. We take user safety seriously and investigate any reports thoroughly.
ur: بالکل! اگر آپ کا سامنا کسی ایسے شخص سے ہوتا ہے جو آپ کو تکلیف دیتا ہے، تو آپ آسانی سے ان کے پروفائل کے ذریعے انہیں بلاک یا رپورٹ کر سکتے ہیں۔ ہم صارف کی حفاظت کو سنجیدگی سے لیتے ہیں اور کسی بھی رپورٹ کی اچھی طرح چھان بین کرتے ہیں

# answer5
source: Friendzy is free to use, but we offer premium features through in-app purchases. These features may include unlimited messaging, seeing who liked your profile, and more.
ur: فرینڈزی استعمال کرنے کے لیے مفت ہے، لیکن ہم درون ایپ خریداریوں کے ذریعے پریمیم خصوصیات پیش کرتے ہیں۔ ان خصوصیات میں لامحدود پیغام رسانی، یہ دیکھنا کہ آپ کا پروفائل کس نے پسند کیا، اور بہت کچھ شامل ہو سکتا ہے۔

# answer6
source: If you wish to delete your account, go to the app profile tab, select Setting,” and choose the option to delete your account. Please note that this action is permanent and cannot be undone.
ur: اگر آپ اپنا اکاؤنٹ ڈیلیٹ کرنا چاہتے ہیں تو ایپ پروفائل ٹیب پر جائیں، سیٹنگ کو منتخب کریں اور اپنا اکاؤنٹ ڈیلیٹ کرنے کا آپشن منتخب کریں۔ براہ کرم نوٹ کریں کہ یہ کارروائی مستقل ہے اور اسے کالعدم نہیں کیا جا سکتا۔

# answer7
source: Yes! Friendzy is designed to cater to a wide range of relationship preferences, from casual dating to serious commitments. You can specify your intentions in your profile.
ur: جی ہاں! فرینڈزی کو آرام دہ اور پرسکون ڈیٹنگ سے لے کر سنجیدہ وعدوں تک تعلقات کی ترجیحات کی ایک وسیع رینج کو پورا کرنے کے لیے ڈیزائن کیا گیا ہے۔ آپ اپنے پروفائل میں اپنے ارادوں کی وضاحت کر سکتے ہیں۔

# answer8
source: To reset your password, go to the sign in with email screen, select “Forgot Password?”, and follow the instructions sent to your registered email.
ur: اپنا پاس ورڈ دوبارہ ترتیب دینے کے لیے، ای میل اسکرین کے ساتھ سائن ان پر جائیں، 'پاس ورڈ بھول گئے؟' کو منتخب کریں، اور اپنے رجسٹرڈ ای میل پر بھیجی گئی ہدایات پر عمل کریں۔

# answer9
source: If you experience any technical difficulties, please contact our support team through the app or our website. We’re here to help you!
ur: اگر آپ کو کوئی تکنیکی دشواری پیش آتی ہے تو، براہ کرم ایپ یا ہماری ویب سائٹ کے ذریعے ہماری سپورٹ ٹیم سے رابطہ کریں۔ ہم آپ کی مدد کے لیے حاضر ہیں

# answer10
source: Yes! Friendzy is available in multiple countries. You can connect with people in different locations and adjust your search preferences accordingly.
ur: جی ہاں! فرینڈزی متعدد ممالک میں دستیاب ہے۔ آپ مختلف مقامات پر لوگوں سے رابطہ قائم کر سکتے ہیں اور اس کے مطابق اپنی تلاش کی ترجیحات کو ایڈجسٹ کر سکتے ہیں۔
